---
type: DimensionEqualityLabelFormatting
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# DimensionEqualityLabelFormatting

`Autodesk.Revit.DB.DimensionEqualityLabelFormatting` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DimensionEqualityLabelFormatting | 2017 Subscription Update | `public DimensionEqualityLabelFormatting ( int leadingSpaces , string prefix , LabelType labelType , string suffix , FormatOptions formatOptions )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetFormatOptions | 2017 Subscription Update | `public FormatOptions GetFormatOptions ()` |
| Method | IsValidFormatOptions | 2017 Subscription Update | `public bool IsValidFormatOptions ()` |
| Method | SetFormatOptions | 2017 Subscription Update | `public void SetFormatOptions ( FormatOptions formatOptions )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LabelType | 2017 Subscription Update | `public LabelType LabelType { get ; }` |
| Property | LeadingSpaces | 2017 Subscription Update | `public int LeadingSpaces { get ; set ; }` |
| Property | Prefix | 2017 Subscription Update | `public string Prefix { get ; set ; }` |
| Property | Suffix | 2017 Subscription Update | `public string Suffix { get ; set ; }` |